erpdev.СХК_Расширение/src/DataProcessors/СХК_ТСДСырье/СХК_ТСДСырье.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_ТСДСырье</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабПриемка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="91453e18-03ae-4724-8a0e-3401542ee57a">
      <name>ДокументОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dfa19489-ad65-49e8-bcaa-38abf251ab1a">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="608ab205-e85c-4c0c-bb0a-19c0fcca2cd5">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Documents/ПриобретениеТоваровУслуг/ПриобретениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриобретениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f3631163-ecf9-4949-af6b-b3c894a40c91">
    <name>ДопоступлениеПоДокументу</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a272903-ac15-4c54-83f5-b82f1b6b646d">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="941aa10e-3657-48ec-8f9d-92e38e90ecbf">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8838bcd9-5b8b-43a2-af1e-aa9708955035">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="422786fa-18ea-4f26-8dd6-4a588060e399">
      <name>ЗаказПоставщику</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2a1df39c-cbfc-404b-9562-a5843f5ff91e">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="fe8e86bc-a667-4a44-bce5-642d9aeae84c">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0cc415ea-d44d-4d76-bb55-6a68970d24dd">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/DataProcessors/СХК_ТСДСырье/Forms/ФормаПОрдер/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	Если СтруктураПараметров.Ссылка <> "" Тогда
		ДокСсылка = СтруктураПараметров.Ссылка;  
		ХозяйственнаяОперация = СтруктураПараметров.Ссылка.ХозяйственнаяОперация; 
		Поставщик =СтруктураПараметров.Ссылка.Партнер; 
		Склад =СтруктураПараметров.Склад; 
		//Если ДокСсылка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика Тогда
		Объект.ТабПриемка.Очистить(); 
		Объект.Склад = ДокСсылка.Склад;
		ДатаВхДок = ТекущаяДата();
		Для Каждого стр из ДокСсылка.Товары Цикл
			Т =  Объект.ТабПриемка.Добавить();
			Т.Номенклатура = стр.Номенклатура;
			Т.Характеристика = стр.Характеристика;
			Т.Количество = стр.Количество;
			Т.Упаковка = стр.Упаковка;
			Т.ШтихКод = УстановкаШК(стр.Номенклатура);
			Т.Цена = стр.Цена;
		КонецЦикла;
	КонецЕсли;
	Если Объект.ТабПриемка.Количество() >=1 Тогда
		Для Каждого строка из Объект.ТабПриемка Цикл
			Если строка.Номенклатура.ВидНоменклатуры.ИспользоватьСерии = Ложь Тогда
								
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ЭтаФорма.Элементы.ГруппаСписок.Видимость = Истина;
	ЭтаФорма.Элементы.ГруппаПриемка.Видимость = Ложь;
	

КонецПроцедуры

&НаСервере
Функция УстановкаШК(Н)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура"; 
	Запрос.УстановитьПараметр("Номенклатура",Н);
	//Рез = Запрос.Выполнить();
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПерваяЗапись = Выборка;
	КонецЕсли;  
	
	Попытка
   		Возврат ПерваяЗапись.Штрихкод;
	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции


&НаСервере
Процедура ТабПриемкаВыборНаСервере(Ном,Цена,Кол,Номер) 
	
	ЭтаФорма.Товар = Ном;
	ЭтаФорма.Количество = Кол;
	ЭтаФорма.Цена = Цена; 
	ЭтаФорма.ТекСтрока = Номер;
	ЭтаФорма.СерияНоменклатура = Справочники.СерииНоменклатуры.ПустаяСсылка();
	
	Если Ном.ВидНоменклатуры.ИспользоватьСерии = Ложь Тогда 
		ЭтаФорма.Элементы.ГруппаСерия.Видимость = Ложь;
		ЭтаФорма.Элементы.Принять.Доступность = Истина;
	Иначе  
		ЭтаФорма.Элементы.ГруппаСерия.Видимость = Истина;
		ЭтаФорма.Элементы.Принять.Доступность = Ложь;
		
		Объект.СрокГодности = 0;
		ЭтаФорма.Элементы.СрокГодности.ТолькоПросмотр = Ложь;
		ЭтаФорма.ДатаИзготовления = Дата(1,1,1);
		ЭтаФорма.ГоденДо = Дата(1,1,1); 
	КонецЕсли;
	
	ЭтаФорма.Элементы.ГруппаСписок.Видимость = Ложь;
	ЭтаФорма.Элементы.ГруппаПриемка.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабПриемкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТабПриемкаВыборНаСервере(Элемент.ТекущиеДанные.Номенклатура,
							Элемент.ТекущиеДанные.Цена,
							Элемент.ТекущиеДанные.Количество,
							Элемент.ТекущиеДанные.НомерСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)  
	
	ПоискШКТест(Текст);
		
КонецПроцедуры  

&НаСервере
Процедура ПоискШКТест(Т)
	Отбор = Новый Структура;
	Отбор.Вставить("ШтихКод",Т);
	Строки = Объект.ТабПриемка.НайтиСтроки(Отбор);
	Если Строки.Количество() = 1 Тогда
		ЭтаФорма.Элементы.ГруппаСписок.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаПриемка.Видимость = Истина;
		ТабПриемкаВыборНаСервере(Строки[0].Номенклатура,
								Строки[0].Цена,
								Строки[0].Количество,
								0);	
	ИначеЕсли Строки.Количество() >= 1 Тогда
		ЭтаФорма.Элементы.ГруппаСписок.Видимость = Истина;
		ЭтаФорма.Элементы.ТабПриемка.ОтборСтрок = Новый ФиксированнаяСтруктура("ШтихКод", Т);
		ЭтаФорма.Элементы.ОтменитьПоиск.Видимость = Истина;
	ИначеЕсли Строки.Количество() = 0 Тогда
		
	Иначе
		
	КонецЕсли;
	
		
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ЭтаФорма.Элементы.ГруппаСписок.Видимость = Истина;
	ЭтаФорма.Элементы.ГруппаПриемка.Видимость = Ложь;
    ОтменитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура  ОтменитьНаСервере()
	ЭтаФорма.Элементы.ТабПриемка.ОтборСтрок = Неопределено;	
КонецПроцедуры

&НаСервере
Процедура ОтменитьПоискНаСервере()
	ЭтаФорма.Элементы.ТабПриемка.ОтборСтрок = Неопределено;  
	ЭтаФорма.Элементы.ОтменитьПоиск.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоиск(Команда)
	ОтменитьПоискНаСервере();
КонецПроцедуры

&НаСервере
Процедура СрокГодностиПриИзмененииНаСервере()
	ЭтаФорма.Элементы.ГоденДо.ТолькоПросмотр = Ложь;
	ЭтаФорма.Элементы.ДатаИзготовления.ТолькоПросмотр = Ложь;
	ЭтаФорма.Элементы.СрокГодности.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СрокГодностиПриИзменении(Элемент)
	СрокГодностиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьСериюНаСервере()
	спр = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	спр.ВидНоменклатуры = Товар.ВидНоменклатуры;
	спр.ГоденДо = ЭтаФорма.ГоденДо; 
	ДатаПроизводства =  ЭтаФорма.ДатаИзготовления;
	спр.ДатаПроизводства = ДатаПроизводства;  
	левСпр = Лев(Строка(Формат(ЭтаФорма.ГоденДо, "ггггММдд")),10);
	левСпр = СтрЗаменить(левСпр,".","");
	спр.Номер = Строка(ЭтаФорма.Префикс) + левСпр;
	спр.Записать();
	ЭтаФорма.СерияНоменклатура = спр.Ссылка; 
	ЭтаФорма.Элементы.Принять.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСерию(Команда)
	СоздатьСериюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПринятьНаСервере() 
	Объект.ТабПриемка[ЭтаФорма.ТекСтрока-1].КоличествоСобрано = 0 ;
	Объект.ТабПриемка[ЭтаФорма.ТекСтрока-1].КоличествоСобрано = ЭтаФорма.Количество;
	Объект.ТабПриемка[ЭтаФорма.ТекСтрока-1].Серия = ЭтаФорма.СерияНоменклатура;
	ЭтаФорма.Элементы.ГруппаСписок.Видимость = Истина;
	ЭтаФорма.Элементы.ГруппаПриемка.Видимость = Ложь;
	ЭтаФорма.Элементы.ТабПриемка.ОтборСтрок = Неопределено;  
	ЭтаФорма.Элементы.ОтменитьПоиск.Видимость = Ложь; 
	
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	ПринятьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГоденДоПриИзмененииНаСервере()
	ЭтаФорма.Элементы.СоздатьСерию.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГоденДоПриИзменении(Элемент)
	ГоденДоПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьНаСервере()
		СоздатьПриходныйОрдер();
        ЭтаФорма.Закрыть();      
		
КонецПроцедуры

&НаСервере
Функция СписокНоменклатуры() 
	
	Мас = Новый Массив;
	
	Для Каждого стр из Объект.ТабПриемка Цикл
		СЗ = Новый Структура;
		СЗ.Вставить("Номенклатура",Строка(стр.Номенклатура.Код));
		СЗ.Вставить("Серия",Строка(стр.Серия));
		СЗ.Вставить("Количество",Строка(стр.Количество));
		Мас.Добавить(СЗ);
	КонецЦикла; 
	
	Возврат Мас;
КонецФункции


&НаСервере
Функция ПроверитьЗаполнениеТаб() 
	Ош = Истина;
	Для Каждого стр из Объект.ТабПриемка Цикл 
		Если стр.Количество <> стр.КоличествоСобрано Тогда 
			Ош = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ош;
КонецФункции


&НаКлиенте
Процедура Завершить(Команда)  
	Если ПроверитьЗаполнениеТаб() Тогда
		ЗавершитьНаСервере();        
	Иначе 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Не все строки приняты",5,"Внимание!!!");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
	
	
КонецПроцедуры


&НаКлиенте
Процедура СерияНоменклатураПриИзменении(Элемент)
	СерияНоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СерияНоменклатураПриИзмененииНаСервере() 
	ЭтаФорма.Элементы.Принять.Доступность = Истина;
КонецПроцедуры

&НаСервере
Процедура ДатаИзготовленияПриИзмененииНаСервере()
	ЭтаФорма.ГоденДо = ДобавитьМесяц(ЭтаФорма.ДатаИзготовления,Объект.СрокГодности); 
	ЭтаФорма.Элементы.СоздатьСерию.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаИзготовленияПриИзменении(Элемент)
	ДатаИзготовленияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СрокГодностиПриИзменении1(Элемент)
	СрокГодностиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаНаПоступление",ЭтотОбъект);	
 
   	 ПоказатьВопрос(Оповещение,
        	"Создать поступление",
        	РежимДиалогаВопрос.ДаНет,
        	0, // таймаут в секундах
        	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        	"Создать ордер" // (необ.) заголовок
    	);    		

КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопросаНаПоступление(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
    	ОтправитьУведомление();
	КонецЕсли;	
 
КонецПроцедуры    

&НаКлиенте
Функция ПолучитьПрофильПочты() 
	//Создаем профиль либо считываем из справочника 
	Профиль = Новый ИнтернетПочтовыйПрофиль; 
	Профиль.АдресСервераSMTP = "smtp.mail.ru";//Отправитель.АдресСервераSMTP; //"smtp.mail.ru"; 
	Профиль.АдресСервераPOP3 = "pop.mail.ru"; //Отправитель.АдресСервераPOP3; //"pop.mail.ru"; 
	Профиль.ПортPOP3 = 995;//Отправитель.ПортPOP3; //110;
	Профиль.ПортSMTP = 465;//Отправитель.ПортSMTP; //587; 
	Профиль.Пользователь = "1c@smartbar.ru";// 
	Профиль.Пароль = "GrKV5YLckkiM5AsF8Byt";
	Профиль.ПользовательSMTP =  "1c@smartbar.ru";//Отправитель.Email; //"test@mail.ru"; 
	Профиль.ПарольSMTP = "GrKV5YLckkiM5AsF8Byt";//Отправитель.Пароль; //"123456789"; 
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	Профиль.ИспользоватьSSLPOP3 = Истина;
	Профиль.ИспользоватьSSLSMTP = Истина;  
	//Создаем письмо 
	Возврат Профиль;
КонецФункции


&НаКлиенте
Процедура ОтправитьУведомление()
	М = СоздатьДокументПоступленияТоваровИУслуг();
	
	Почта = Новый ИнтернетПочта; 
	Письмо = Новый ИнтернетПочтовоеСообщение;
	ТекстПисьма = ""+ Символы.ПС; 
	ТекстПисьма = ТекстПисьма + "Дата документа: "+Строка(М[1]) + Символы.ПС; 
	ТекстПисьма = ТекстПисьма + "Номер документа: "+Строка(М[0]) + Символы.ПС; 
	ТекстПисьма = ТекстПисьма + "Контрагент: "+Строка(М[2]) + Символы.ПС; 
	
	
	Текст = Письмо.Тексты.Добавить(ТекстПисьма); 
	//Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;	
	
	Письмо.Тема = Строка(Строка("Приемка сырья на склад Сырья и материалов")); 
	Письмо.Отправитель = "1c@smartbar.ru"; 
	Письмо.ИмяОтправителя = "Уведомление 1С ЕРП приемка сырья";
	
	
	Письмо.Получатели.Добавить("igor.potemkin33@yandex.ru");
	Письмо.Получатели.Добавить("glbuh@smartbar.ru");
	Письмо.Получатели.Добавить("buh1@smartbar.ru");
	Попытка
		Почта.Подключиться(ПолучитьПрофильПочты()); 
		Почта.Послать(Письмо); 
	Исключение 
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Почта.Отключиться();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПриходныйОрдер()
	Д = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	Д.Дата = ТекущаяДата();
	Д.Распоряжение = ДокСсылка;
	Д.Отправитель = Поставщик;
	Д.Склад = Склад;
	Д.ДатаВходящегоДокумента = ЭтаФорма.ДатаВхДок; 
	Д.НомерВходящегоДокумента = ЭтаФорма.НомерВхДок;
	Д.ХозяйственнаяОперация = ХозяйственнаяОперация;  
	Д.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаОтПоставщика; 
	Д.Статус =  Перечисления.СтатусыПриходныхОрдеров.Принят;
	Для Каждого стр из Объект.ТабПриемка Цикл 
		Т = Д.Товары.Добавить();
		Т.ДокументОтгрузки = ДокСсылка;
		Т.Номенклатура = стр.Номенклатура;
		Т.Количество = стр.Количество; 
		Т.КоличествоУпаковок = стр.Количество;
		Если стр.Серия <> Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
			Т.Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(стр.Серия).Ссылка;
			Т.СтатусУказанияСерий = 2;
		Иначе
			Т.СтатусУказанияСерий = 0;
		КонецЕсли;
	КонецЦикла;
	Д.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	
	//СС = Д.Ссылка.ПолучитьОбъект();
	//ПроведениеДокументов.ОбработкаПроведенияДокумента(Д, Ложь);
КонецПроцедуры


&НаСервере
Функция СоздатьДокументПоступленияТоваровИУслуг()  
НовыйДокумент = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент(); 
НовыйДокумент.Заполнить(ЭтаФорма.ДокСсылка);
НовыйДокумент.Дата = ТекущаяДата();
НовыйДокумент.ДатаВходящегоДокумента = ЭтаФорма.ДатаВхДок;
НовыйДокумент.НомерВходящегоДокумента  = ЭтаФорма.НомерВхДок;
НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
 
	Мас = Новый Массив;
	Мас.Добавить(Строка(НовыйДокумент.Ссылка.Номер));
	Мас.Добавить(Строка(НовыйДокумент.Ссылка.Дата));
	Мас.Добавить(Строка(НовыйДокумент.Ссылка.Контрагент));
	Возврат Мас;
КонецФункции
